Revit 2027 API
ParameterTypeId.FbxLightEmitRectangleLength Property
 "Emit from Rectangle Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FbxLightEmitRectangleLength { get; }
Public Shared ReadOnly Property FbxLightEmitRectangleLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FbxLightEmitRectangleLength {
	ForgeTypeId^ get ();
}
static member FbxLightEmitRectangleLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace